Revit 2027 API
BuiltInFailures.StructuralSectionsFailures.StructuralSectionShapesDoNotMatch Property
 Family Shape does not match the geometry of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralSectionShapesDoNotMatch { get; }
Public Shared ReadOnly Property StructuralSectionShapesDoNotMatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralSectionShapesDoNotMatch {
	FailureDefinitionId^ get ();
}
static member StructuralSectionShapesDoNotMatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralSectionsFailures Class
Autodesk.Revit.DB Namespace